resources/testplans/mongodb/TestPlan-MongoDB-GridFSChunkWrite.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9-SNAPSHOT.20130430">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <longProp name="ThreadGroup.start_time">1380719248000</longProp>
        <longProp name="ThreadGroup.end_time">1380719248000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <mongodb.MongoConfigElement guiclass="TestBeanGUI" testclass="mongodb.MongoConfigElement" testname="Custom - MongoDB Connection Configuration" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionsPerHost">10</stringProp>
          <stringProp name="database">test</stringProp>
          <stringProp name="host">testdb-pc.cern.ch</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">False</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">5</stringProp>
          <stringProp name="username">testUser</stringProp>
        </mongodb.MongoConfigElement>
        <hashTree/>
        <binaryinfo.BinaryConfigElement guiclass="TestBeanGUI" testclass="binaryinfo.BinaryConfigElement" testname="Custom - BinaryFileInfo Configuration" enabled="true">
          <stringProp name="binaryInfo">binInfo</stringProp>
          <stringProp name="inputLocation">/home/cb/CMS/Projects/PaGeS/fb6fd61e48a708d56383/out</stringProp>
        </binaryinfo.BinaryConfigElement>
        <hashTree/>
        <mongodb.MongoSampler guiclass="TestBeanGUI" testclass="mongodb.MongoSampler" testname="Custom - MongoDB Sampler" enabled="true">
          <stringProp name="assignedWrite">False</stringProp>
          <stringProp name="binaryInfo">binInfo</stringProp>
          <stringProp name="checkRead">True</stringProp>
          <stringProp name="database">test</stringProp>
          <stringProp name="doRead">False</stringProp>
          <stringProp name="doWrite">True</stringProp>
          <stringProp name="gridFsMethod">True</stringProp>
          <stringProp name="useChunks">True</stringProp>
          <stringProp name="useRandomAccess">True</stringProp>
        </mongodb.MongoSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>